{
  "timestamp": "2025-08-04T13:38:24.117514",
  "agent": "Ethics Expert",
  "input": "Use the the provided context for a response to the user query.\n                user_query: What does Buddhism say about stealing? \n                context: While Buddhism encourages wealth gained ethically,[171] it sees greed and craving for riches as negative, and praises contentment as 'the greatest wealth'. Poverty and debt are seen as causes of suffering, immorality, and social unrest if they prevent one from having basic necessities and peace of mind. For laypeople, Buddhism promotes the middle way between a life of poverty and a materialistic or consumerist life in which one is always seeking to enrich oneself and to buy more things.[181] For Buddhist laypersons then, to be Buddhist does not mean to reject all material things, but, according to Sizemore and Swearer: \"it specifies an attitude to be cultivated and expressed in whatever material condition one finds oneself. To be non-attached is to possess and use material things but not to be possessed or used by them. Therefore, the idea of non-attachment applies all across Buddhist society, to laymen and monk alike.\"[182]\n\n^ Keown, Damien; Buddhist Ethics A Very Short Introduction, pg 5.\n\n^ Peter Harvey An Introduction to Buddhist Ethics Cambridge University Press 2000, page 19.\n\n^ Keown 2003, p. 268.\n\n^ a b Stewart McFarlane in Peter Harvey, ed., Buddhism. Continuum, 2001, pages 195-196.\n\n^ Terwiel 2012, p. 181.\n\n^ a b \"Bodhi Monastery: the Five Precepts\". Archived from the original on 2010-11-23. Retrieved 2011-03-14.\n\n^ Harvey 2000, p. 80.\n\n^ Edelglass 2013, p. 479.\n\n^ Harvey 2000, p. 68.\n\n^ a b Gwynne 2017, The Buddhist Pancasila.\n\n^ Keown 2013, p. 618.\n\n^ Edelglass 2013, p. 481.\n\n^ Keown 2012, pp. 31–4.\n\n^ Seeger 2010, p. 78.\n\n^ Ledgerwood & Un 2010, p. 541.\n\n^ Seeger 2010, pp. 78, 85.\n\n^ Keown 2013, p. 616.\n\n^ Harvey 2000, pp. 33, 71, 120.\n\n^ Ratanakul 2007, p. 241.\n\n^ Horigan 1996, p. 276.\n\n^ Alarid & Wang 2001, pp. 236–7.\n\n^ Keown 2016a, p. 213.\n\n^ Perrett 2000, p. 110.\n\n^ Keown 2016b, p. 170.\n\n^ Harvey 2000, pp. 71–2, 74, 76.\n\n^ Wijayaratna 1990, pp. 166–7.\n\n^ Harvey 2000, p. 77.\n\nHarvey, Peter (2000), An Introduction to Buddhist Ethics: Foundations, Values and Issues (PDF), Cambridge University Press, ISBN 978-0-511-07584-1, archived from the original (PDF) on 2019-04-12, retrieved 2018-11-29\nHorigan, D.P. (1996), \"Of Compassion and Capital Punishment: A Buddhist Perspective on the Death Penalty\", American Journal of Jurisprudence, 41: 271–288, doi:10.1093/ajj/41.1.271\nKaza, Stephanie (2000), \"Overcoming the Grip of Consumerism\", Buddhist-Christian Studies, 20: 23–42, doi:10.1353/bcs.2000.0013, JSTOR 1390317, S2CID 1625439\nKeown, Damien (2003), A Dictionary of Buddhism, Oxford University Press, ISBN 978-0-19-157917-2\nKeown, Damien (2012), \"Are There Human Rights in Buddhism?\", in Husted, Wayne R.; Keown, Damien; Prebish, Charles S. (eds.), Buddhism and Human Rights, Routledge, pp. 15–42, ISBN 978-1-136-60310-5\n                ",
  "response": "Buddhism strongly discourages stealing. While it doesn't necessarily forbid all material possessions, it views greed and craving for wealth as negative, emphasizing contentment as true wealth. Poverty and debt are seen as sources of suffering and potential causes of social unrest if they prevent basic needs and peace of mind. For laypeople, Buddhism advocates for a balanced approach, avoiding both extreme poverty and excessive materialism. The key is to cultivate non-attachment – to use material things without being controlled or defined by them. This principle of non-attachment applies to all Buddhists, both lay and monastic."
}